expense_changes = {
    '식료품': (2434, 2212),
    '의류': (1516, 1371),
    '가전제품': (5078, 4764),
    '스포츠용품': (252, 213),
    '교통': (503, 496),
    '미용': (252, 239),
    '의료': (1529, 1514),
    '여행': (489, 364),
    '문화': (247, 247),
    '음식점': (1479, 1368),
    '주류': (1516, 1489),
    '통신': (49, 48),
    '가정용품': (301, 292),
    '도서': (97, 95),
    '유류비': (1492, 1480),
    '반려동물': (99, 91),
    '유아용품': (100, 97),
    '교육': (2447, 2435)
}

print("소비 카테고리 변화:")
for category, changes in expense_changes.items():
    print(f"{category}: {changes[0]} -> {changes[1]}")